package com.company.project.sms;

public enum CodeStatus {

	OK("200", "操作成功"), S1("201", "客户端版本不对，需升级sdk"), S2("301", "被封禁"), S3("302", "用户名或密码错误"), S4("315", "IP限制"), S5("403", "非法操作或没有权限"), S6("404", "对象不存在"), S7("405", "参数长度过长"),
	S8("406", "对象只读"), S9("408", "客户端请求超时"), S10("413", "验证失败(短信服务)"), S11("414", "参数错误"), S12("415", "客户端网络问题"), S13("416", "频率控制"), S14("417", "重复操作"), S15("418", "通道不可用(短信服务)"),
	S16("419", "数量超过上限"), S17("422", "账号被禁用"), S18("431", "HTTP重复请求"), S19("500", "服务器内部错误"), S20("503", "服务器繁忙"), S21("508", "消息撤回时间超限"), S22("509", "无效协议"), S23("514", "服务不可用"),
	S24("998", "解包错误"), S25("999", "打包错误"),
	/*
	 * 群相关错误码
	 */
	S26("801", "群人数达到上限"),
	S27("802", "没有权限"),
	S28("803", "群不存在"),
	S29("804", "用户不在群"),
	S30("805", "群类型不匹配"),
	S31("806", "创建群数量达到限制"),
	S32("807", "群成员状态错误"),
	S33("808", "申请成功"),
	S34("809", "已经在群内"),
	S35("810", "邀请成功"),
	S36("815", "群管理员人数超过上限"),
	/*
	 * 音视频、白板通话相关错误码
	 */
	S37("9102",	"通道失效"),
	S38("9103",	"已经在他端对这个呼叫响应过了"),
	S39("11001",	"通话不可达，对方离线状态"),
	/*
	 * 聊天室相关错误码
	 */
	S40("13001",	"IM主连接状态异常"),
	S41("13002",	"聊天室状态异常"),
	S42("13003",	"账号在黑名单中,不允许进入聊天室"),
	S43("13004",	"在禁言列表中,不允许发言"),
	S44("13005",	"用户的聊天室昵称、头像或成员扩展字段被反垃圾"),
	/*
	 * 特定业务相关错误码
	 */
	S45("10431",	"输入email不是邮箱"),
	S46("10432",	"输入mobile不是手机号码"),
	S47("10433",	"注册输入的两次密码不相同"),
	S48("10434",	"企业不存在"),
	S59("10435",	"登陆密码或帐号不对"),
	S50("10436",	"app不存在"),
	S51("10437",	"email已注册"),
	S52("10438",	"手机号已注册"),
	S53("10441",	"app名字已经存在");
	
	private final String code;
	private final String message;

	private CodeStatus(String code, String message) {
		this.code = code;
		this.message = message;
	}

	public String getCode() {
		return code;
	}

	public String getMessage() {
		return message;
	}

	@Override
	public String toString() {
		return "CodeStatus [code=" + code + ", message=" + message + "]";
	}

}
